<script setup>
  import Header from "./components/Header.vue"
  import Card from "./components/Card.vue"

  const items = [{
    title: "Олимпиада «Наше наследие»",
    description: "Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой",
    date: "Какая-то дата... 5 мая",
    grades: "8-11 классы",
    subjects: ["История"],
  }];

</script>

<template>
  <Header/>
  <div class="main bg-white w-3/5 m-auto mt-40 shadow-md">

    <Card title="Олимпиада «Наше наследие»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 5 мая" grades="8-11 классы"/>
    <Card title="Олимпиада «13 элемент. ALхимия будущего»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 15 июня" grades="11 класс"/>
    <Card title="Олимпиада «Наше наследие»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 5 мая" grades="8-11 классы"/>
    <Card title="Олимпиада «13 элемент. ALхимия будущего»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 15 июня" grades="11 класс"/>
    <Card title="Олимпиада «Наше наследие»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 5 мая" grades="8-11 классы"/>
    <Card title="Олимпиада «13 элемент. ALхимия будущего»" description="Олимпиада проводится среди учащихся всех классов в 4 тура, организуются также различные дополнительные конкурсы. Попробовать свои силы будет интересно тем, кто увлекается отечественной историей и культурой" date="Какая-то дата... 15 июня" grades="11 класс"/>

  </div>

</template>

<style>
  @import url('https://fonts.googleapis.com/css2?family=Comfortaa:wght@300..700&display=swap');
  @import url('https://fonts.googleapis.com/css2?family=Montserrat:ital,wght@0,100..900;1,100..900&display=swap');

</style>
